Update README.md, plantuml to mermaid
